; domain
(define (domain dominio-drones-2)
  (:requirements :strips :typing :action-costs)

  (:types
    dron persona localizacion caja contenido contenedor num)

  (:predicates
    (dron-en ?d - dron ?l - localizacion)
    (caja-en ?c - caja ?l - localizacion)
    (persona-en ?p - persona ?l - localizacion)
    (en-deposito ?l - localizacion)

    (tiene ?p - persona ?t - contenido)
    (contiene ?c - caja ?t - contenido)
    (contenedor-libre ?k - contenedor) 
    
    (necesita ?p - persona ?t - contenido)

    (tiene-contenedor ?d - dron ?k - contenedor)
    (en-contenedor ?k - contenedor ?c - caja)
    (dron-libre ?d - dron)
    
    (tiene-caja ?d - dron ?c - caja)
    (caja-libre ?c - caja)
    (dron-sin-caja ?d - dron)
  
    (siguiente ?n1 - num ?n2 - num)
    (cajas-en-contenedor ?k - contenedor ?n - num)
    (cero ?n - num)
  )

  (:functions
    (fly-cost ?l1 - localizacion ?l2 - localizacion)
    (total-cost)
  )

  (:action coger
    :parameters (
      ?d - dron 
      ?k - contenedor 
      ?l - localizacion
      ?n - num
    )
    :precondition (and
      (dron-en ?d ?l)
      (en-deposito ?l)
      (dron-libre ?d)
      (contenedor-libre ?k)
      (cero ?n)
    )
    :effect (and
      (tiene-contenedor ?d ?k)
      (not (dron-libre ?d))
      (not (contenedor-libre ?k))
      (cajas-en-contenedor ?k ?n)
    )
  )
  
  (:action dejar
    :parameters (
      ?d - dron 
      ?k - contenedor 
      ?l - localizacion
      ?n - num
    )
    :precondition (and
      (dron-en ?d ?l)
      (en-deposito ?l)
      (tiene-contenedor ?d ?k)
      (cero ?n)
      (cajas-en-contenedor ?k ?n)
    )
    :effect (and
      (not (tiene-contenedor ?d ?k))
      (dron-libre ?d)
      (contenedor-libre ?k)
    )
  )
  
  (:action coger-caja
    :parameters (
      ?d - dron 
      ?c - caja 
      ?l - localizacion
    )
    :precondition (and
      (dron-en ?d ?l)
      (caja-en ?c ?l)
      (dron-sin-caja ?d)
      (caja-libre ?c)
    )
    :effect (and
      (tiene-caja ?d ?c)
      (not (dron-sin-caja ?d))
      (not (caja-libre ?c))
      (not (caja-en ?c ?l))
    )
  )


  (:action meter
    :parameters (
      ?d - dron 
      ?c - caja 
      ?k - contenedor
      ?n1 ?n2 - num
    )
    :precondition (and 
      (tiene-contenedor ?d ?k)
      (tiene-caja ?d ?c) 
      (siguiente ?n1 ?n2)
      (cajas-en-contenedor ?k ?n1)
    )
    :effect (and
      (en-contenedor ?k ?c) 
      (not (tiene-caja ?d ?c))
      (dron-sin-caja ?d) 
      (not (cajas-en-contenedor ?k ?n1))
      (cajas-en-contenedor ?k ?n2)
    )
  )
  
  (:action sacar
    :parameters (
      ?d - dron 
      ?c - caja 
      ?k - contenedor
      ?n1 ?n2 - num
    )
    :precondition (and
      (tiene-contenedor ?d ?k)
      (en-contenedor ?k ?c)
      (dron-sin-caja ?d)
      (siguiente ?n1 ?n2)
    )
    :effect (and
      (not (en-contenedor ?k ?c)) 
      (not (cajas-en-contenedor ?k ?n2))
      (cajas-en-contenedor ?k ?n1)
      (not (dron-sin-caja ?d))
      (tiene-caja ?d ?c)
    )
  )

  (:action volar
    :parameters (
      ?d - dron 
      ?from - localizacion 
      ?to - localizacion
    )
    :precondition (and
      (dron-en ?d ?from)
      (dron-sin-caja ?d)
    )
    :effect (and
      (not (dron-en ?d ?from)) 
      (dron-en ?d ?to)
      (increase (total-cost) (fly-cost ?from ?to))
    )
  )

  (:action entregar
    :parameters (
      ?d - dron 
      ?c - caja 
      ?p - persona 
      ?l - localizacion 
      ?t - contenido
    )
    :precondition (and
      (dron-en ?d ?l) 
      (tiene-caja ?d ?c)
      
      (persona-en ?p ?l)              
      (contiene ?c ?t)
      (necesita ?p ?t)
      
    )
    :effect (and
      (tiene ?p ?t)
      (not (necesita ?p ?t))
      (not (tiene-caja ?d ?c))
      (dron-sin-caja ?d)
    )
  )
)

; problem
(define (problem drone_problem_d1_l5_p5_c5_g5_ct2)
(:domain dominio-drones-2)
(:objects
	dron1 - dron
	deposito loc1 loc2 loc3 loc4 loc5 - localizacion
	caja1 caja2 caja3 caja4 caja5 - caja
	comida medicina - contenido
	pers1 pers2 pers3 pers4 pers5 - persona
	k1 - contenedor
n0 n1 n2 n3 n4 - num
)
(:init
	(dron-en dron1 deposito)
	(dron-libre dron1)
	(dron-sin-caja dron1)

	(en-deposito deposito) 
	(contenedor-libre k1)

	(caja-en caja1 deposito) (caja-libre caja1)(contiene caja1 comida)
	(caja-en caja2 deposito) (caja-libre caja2)(contiene caja2 comida)

	(caja-en caja3 deposito)(caja-libre caja3)(contiene caja3 medicina)
	(caja-en caja4 deposito)(caja-libre caja4)(contiene caja4 medicina)
	(caja-en caja5 deposito)(caja-libre caja5)(contiene caja5 medicina)

	(persona-en pers1 loc1)(necesita pers1 medicina)
	(persona-en pers2 loc2)(necesita pers2 comida)
	(persona-en pers3 loc3)(necesita pers3 comida)
(necesita pers3 medicina)
	(persona-en pers4 loc4)
	(persona-en pers5 loc5)(necesita pers5 medicina)

	(= (fly-cost deposito loc1) 17)
	(= (fly-cost deposito loc2) 25)
	(= (fly-cost deposito loc3) 14)
	(= (fly-cost deposito loc4) 30)
	(= (fly-cost deposito loc5) 38)
	(= (fly-cost loc1 deposito) 17)
	(= (fly-cost loc1 loc2) 9)
	(= (fly-cost loc1 loc3) 6)
	(= (fly-cost loc1 loc4) 15)
	(= (fly-cost loc1 loc5) 22)
	(= (fly-cost loc2 deposito) 25)
	(= (fly-cost loc2 loc1) 9)
	(= (fly-cost loc2 loc3) 13)
	(= (fly-cost loc2 loc4) 12)
	(= (fly-cost loc2 loc5) 14)
	(= (fly-cost loc3 deposito) 14)
	(= (fly-cost loc3 loc1) 6)
	(= (fly-cost loc3 loc2) 13)
	(= (fly-cost loc3 loc4) 16)
	(= (fly-cost loc3 loc5) 26)
	(= (fly-cost loc4 deposito) 30)
	(= (fly-cost loc4 loc1) 15)
	(= (fly-cost loc4 loc2) 12)
	(= (fly-cost loc4 loc3) 16)
	(= (fly-cost loc4 loc5) 16)
	(= (fly-cost loc5 deposito) 38)
	(= (fly-cost loc5 loc1) 22)
	(= (fly-cost loc5 loc2) 14)
	(= (fly-cost loc5 loc3) 26)
	(= (fly-cost loc5 loc4) 16)

	(cajas-en-contenedor k1 n0)

	(cero n0) 
	(siguiente n0 n1) 
	(siguiente n1 n2) 
	(siguiente n2 n3) 
	(siguiente n3 n4)	(= (total-cost) 0)
)
(:goal (and
	(dron-en dron1 deposito)
	(tiene pers1 medicina)
	(tiene pers2 comida)
	(tiene pers3 comida)
	(tiene pers3 medicina)
	(tiene pers5 medicina)
	))
(:metric minimize (total-cost)))

; plan
1. (coger dron1 k1 deposito n0)
   deleted: (dron-libre dron1) (contenedor-libre k1)
   added: (tiene-contenedor dron1 k1)
   goals met: 1 of 6
2. (coger-caja dron1 caja1 deposito)
   deleted: (dron-sin-caja dron1) (caja-libre caja1) (caja-en caja1 deposito)
   added: (tiene-caja dron1 caja1)
   goals met: 1 of 6
3. (meter dron1 caja1 k1 n0 n1)
   deleted: (tiene-caja dron1 caja1) (cajas-en-contenedor k1 n0)
   added: (en-contenedor k1 caja1) (dron-sin-caja dron1) (cajas-en-contenedor k1 n1)
   goals met: 1 of 6
4. (volar dron1 deposito loc2)
   deleted: (dron-en dron1 deposito)
   added: (dron-en dron1 loc2)
   goals met: 0 of 6
5. (sacar dron1 caja1 k1 n0 n1)
   deleted: (en-contenedor k1 caja1) (cajas-en-contenedor k1 n1) (dron-sin-caja dron1)
   added: (cajas-en-contenedor k1 n0) (tiene-caja dron1 caja1)
   goals met: 0 of 6
6. (entregar dron1 caja1 pers2 loc2 comida)
   deleted: (necesita pers2 comida) (tiene-caja dron1 caja1)
   added: (tiene pers2 comida) (dron-sin-caja dron1)
   goals met: 1 of 6
7. (volar dron1 loc2 deposito)
   deleted: (dron-en dron1 loc2)
   added: (dron-en dron1 deposito)
   goals met: 2 of 6
8. (coger-caja dron1 caja2 deposito)
   deleted: (dron-sin-caja dron1) (caja-libre caja2) (caja-en caja2 deposito)
   added: (tiene-caja dron1 caja2)
   goals met: 2 of 6
9. (meter dron1 caja2 k1 n0 n1)
   deleted: (tiene-caja dron1 caja2) (cajas-en-contenedor k1 n0)
   added: (en-contenedor k1 caja2) (dron-sin-caja dron1) (cajas-en-contenedor k1 n1)
   goals met: 2 of 6
10. (volar dron1 deposito loc3)
   deleted: (dron-en dron1 deposito)
   added: (dron-en dron1 loc3)
   goals met: 1 of 6
11. (sacar dron1 caja2 k1 n0 n1)
   deleted: (en-contenedor k1 caja2) (cajas-en-contenedor k1 n1) (dron-sin-caja dron1)
   added: (cajas-en-contenedor k1 n0) (tiene-caja dron1 caja2)
   goals met: 1 of 6
12. (entregar dron1 caja2 pers3 loc3 comida)
   deleted: (necesita pers3 comida) (tiene-caja dron1 caja2)
   added: (tiene pers3 comida) (dron-sin-caja dron1)
   goals met: 2 of 6
13. (volar dron1 loc3 deposito)
   deleted: (dron-en dron1 loc3)
   added: (dron-en dron1 deposito)
   goals met: 3 of 6
14. (coger-caja dron1 caja3 deposito)
   deleted: (dron-sin-caja dron1) (caja-libre caja3) (caja-en caja3 deposito)
   added: (tiene-caja dron1 caja3)
   goals met: 3 of 6
15. (meter dron1 caja3 k1 n0 n1)
   deleted: (tiene-caja dron1 caja3) (cajas-en-contenedor k1 n0)
   added: (en-contenedor k1 caja3) (dron-sin-caja dron1) (cajas-en-contenedor k1 n1)
   goals met: 3 of 6
16. (volar dron1 deposito loc1)
   deleted: (dron-en dron1 deposito)
   added: (dron-en dron1 loc1)
   goals met: 2 of 6
17. (sacar dron1 caja3 k1 n0 n1)
   deleted: (en-contenedor k1 caja3) (cajas-en-contenedor k1 n1) (dron-sin-caja dron1)
   added: (cajas-en-contenedor k1 n0) (tiene-caja dron1 caja3)
   goals met: 2 of 6
18. (entregar dron1 caja3 pers1 loc1 medicina)
   deleted: (necesita pers1 medicina) (tiene-caja dron1 caja3)
   added: (tiene pers1 medicina) (dron-sin-caja dron1)
   goals met: 3 of 6
19. (volar dron1 loc1 deposito)
   deleted: (dron-en dron1 loc1)
   added: (dron-en dron1 deposito)
   goals met: 4 of 6
20. (coger-caja dron1 caja4 deposito)
   deleted: (dron-sin-caja dron1) (caja-libre caja4) (caja-en caja4 deposito)
   added: (tiene-caja dron1 caja4)
   goals met: 4 of 6
21. (meter dron1 caja4 k1 n0 n1)
   deleted: (tiene-caja dron1 caja4) (cajas-en-contenedor k1 n0)
   added: (en-contenedor k1 caja4) (dron-sin-caja dron1) (cajas-en-contenedor k1 n1)
   goals met: 4 of 6
22. (volar dron1 deposito loc3)
   deleted: (dron-en dron1 deposito)
   added: (dron-en dron1 loc3)
   goals met: 3 of 6
23. (sacar dron1 caja4 k1 n0 n1)
   deleted: (en-contenedor k1 caja4) (cajas-en-contenedor k1 n1) (dron-sin-caja dron1)
   added: (cajas-en-contenedor k1 n0) (tiene-caja dron1 caja4)
   goals met: 3 of 6
24. (entregar dron1 caja4 pers3 loc3 medicina)
   deleted: (necesita pers3 medicina) (tiene-caja dron1 caja4)
   added: (tiene pers3 medicina) (dron-sin-caja dron1)
   goals met: 4 of 6
25. (volar dron1 loc3 deposito)
   deleted: (dron-en dron1 loc3)
   added: (dron-en dron1 deposito)
   goals met: 5 of 6
26. (coger-caja dron1 caja5 deposito)
   deleted: (dron-sin-caja dron1) (caja-libre caja5) (caja-en caja5 deposito)
   added: (tiene-caja dron1 caja5)
   goals met: 5 of 6
27. (meter dron1 caja5 k1 n0 n1)
   deleted: (tiene-caja dron1 caja5) (cajas-en-contenedor k1 n0)
   added: (en-contenedor k1 caja5) (dron-sin-caja dron1) (cajas-en-contenedor k1 n1)
   goals met: 5 of 6
28. (volar dron1 deposito loc5)
   deleted: (dron-en dron1 deposito)
   added: (dron-en dron1 loc5)
   goals met: 4 of 6
29. (sacar dron1 caja5 k1 n0 n1)
   deleted: (en-contenedor k1 caja5) (cajas-en-contenedor k1 n1) (dron-sin-caja dron1)
   added: (cajas-en-contenedor k1 n0) (tiene-caja dron1 caja5)
   goals met: 4 of 6
30. (entregar dron1 caja5 pers5 loc5 medicina)
   deleted: (necesita pers5 medicina) (tiene-caja dron1 caja5)
   added: (tiene pers5 medicina) (dron-sin-caja dron1)
   goals met: 5 of 6
31. (volar dron1 loc5 deposito)
   deleted: (dron-en dron1 loc5)
   added: (dron-en dron1 deposito)
   goals met: 6 of 6
